In [ ]:
Task: create a program
Q1>Create and import file
1. Create schoolmets and collegements friends_names.xls file and import file in spyder (atleast 10 names, columns are FriendName,Quality) ,
2. Summarize data by quality wise no.of friends .
Example: quality | no.of freind
			funny | 2

Q2>Create and import file
1. Create boys Boysfriend_names.xls file and import file in spyder (atleast 10 names, columns are FriendName,Quality)  
2. Summarize data by quality wise no.of friends .
3. Create girls Girlsfriend_names.xls file  and import file in spyder (atleast 10 names, columns are FriendName,Quality) 
4. Summarize data by quality wise no.of friends .


Q3>Create and import file
1. Create a father side fatherfamily_members.xls file and import file in spyder  (atleast 5 names, columns are FamilyMemberName*Relation)
2. Summarize data by relation wise no.of familymembers .
3. Create a mother side montherfamily_members.xls file and import file in spyder  (atleast 5 names, columns are FamilyMemberName*Relation)
4. Summarize data by relation wise no.of familymembers .


Q4>Create and import file
1. Create a Dal related  dal_items.xlsx file and import file in spyder (atleast 5 names, columns are VegFoodName*Taste)
2. Summarize data by taste wise no.of fooditems.
3. Create a vegitable related  vegitable_items.xlsx file and import file in spyder (atleast 5 names, columns are VegFoodName*Taste)
4. Summarize data by taste wise no.of fooditems.


Q5>Create and import file
1. Create a soups related  soups_items.xlsx file and import file in spyder (atleast 5 names, columns are soups*Taste)
2. Summarize data by taste wise no.of fooditems.
3. Create a fry related  fry_items.xlsx file and import file in spyder (atleast 5 names, columns are fry*Taste)
4. Summarize data by taste wise no.of fooditems.


Q6>Create and import file
1. Create a Chicken related chicken_items.xlsx file and import file in spyder (atleast 5 names, columns are NonVegFoodName*Taste)
2. Summarize data by taste wise no.of fooditems.
3. Create a mutton related mutton_items.xlsx file and import file in spyder (atleast 5 names, columns are NonVegFoodName*Taste)
4. Summarize data by taste wise no.of fooditems.



Q7>Create and import file
1. Create a winter season  winterseason_names.xlsx file and import file in spyder  (atleast 2 names, columns are MonthName*Season)
2. Summarize data by Season wise no.of months.
3. Create a summer season  summerseason_names.xlsx file and import file in spyder  (atleast 2 names, columns are MonthName*Season)
4. Summarize data by Season wise no.of months.
5. Create a rainy season  rainyseason_names.xlsx file and import file in spyder  (atleast 2 names, columns are MonthName*Season)
6. Summarize data by Season wise no.of months.


>Create and import file
1. Create a red colour flowers redflowers_names.xlsx file and import file in spyder   (atleast 3 names, columns are FlowerName*color)
2. Summarize data by color wise no.of flowers.
3. Create a white colour flowers whiteflowers_names.xlsx file  and import file in spyder  (atleast 3 names, columns are FlowerName*color)
4. Summarize data by color wise no.of flowers.
5. Create a pink colour flowers whiteflowers_names.xlsx file and import file in spyder   (atleast 3 names, columns are FlowerName*color)
6. Summarize data by color wise no.of flowers.
7. Create a yellow colour flowers whiteflowers_names.xlsx file and import file in spyder   (atleast 3 names, columns are FlowerName*color)
8. Summarize data by color wise no.of flowers.

In [ ]:
#Q1>Create and import file
#1. Create schoolmets and collegements friends_names.xls file and import file in spyder (atleast 10 names, columns are FriendName,Quality) ,
#2. Summarize data by quality wise no.of friends .
#Example: quality | no.of freind
#			funny | 2

In [1]:
import pandas
import pandas as pd
df=pd.read_excel(r"D:\Bujji\schoolmets_names.xlsx")
df

  Friends names      Quality
0    ch.bhavani       silent
1     d.bhavani      voilent
2         durga     innocent
3          rani       clever
4        pavani      stylish
5        chendu  intilligent

In [2]:
df.Quality.unique()

array(['silent', 'voilent', 'innocent', 'clever', 'stylish',
       'intilligent'], dtype=object)

In [3]:
df.groupby('Quality')['Friends names'].count()

Quality
clever         1
innocent       1
intilligent    1
silent         1
stylish        1
voilent        1
Name: Friends names, dtype: int64

In [4]:
import pandas
import pandas as pd
df1=pd.read_excel(r"D:\Bujji\friends_names.xlsx")
df1

  Friends names Qualification      Quality
0      prasanna        b_tech       clever
1        swathi           bsc   intiligent
2       jayasri        b_tech       clever
3         durga           bsc  intilligent
4      nasheena        b_tech       clever
5       mallika           mpc      stylish
6       tuskaru           bsc       silent
7      shamshad           bsc  interactive
8     rahamatha           bsc   intiligent
9      santhosh        b_tech       clever

In [6]:
df1.groupby(['Quality','Friends names'])['Qualification'].count()

Quality      Friends names
clever       jayasri          1
             nasheena         1
             prasanna         1
             santhosh         1
interactive  shamshad         1
intiligent   rahamatha        1
             swathi           1
intilligent  durga            1
silent       tuskaru          1
stylish      mallika          1
Name: Qualification, dtype: int64

In [ ]:
#Q2>Create and import file
#1. Create boys Boysfriend_names.xls file and import file in spyder (atleast 10 names, columns are FriendName,Quality)  
#2. Summarize data by quality wise no.of friends .
#3. Create girls Girlsfriend_names.xls file  and import file in spyder (atleast 10 names, columns are FriendName,Quality) 
#4. Summarize data by quality wise no.of friends .

In [ ]:
#Q3>Create and import file
#1. Create a father side fatherfamily_members.xls file and import file in spyder  (atleast 5 names, columns are FamilyMemberName*Relation)
#2. Summarize data by relation wise no.of familymembers .
#3. Create a mother side montherfamily_members.xls file and import file in spyder  (atleast 5 names, columns are FamilyMemberName*Relation)
#4. Summarize data by relation wise no.of familymembers .

In [8]:
import pandas
import pandas as pd
M1=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\Downloads\Mother side family (1).xlsx")
M1

           names    Relation
0  siva parvathi      mother
1         anjali       pinni
2          seeta        akka
3        meghana  menakodalu
4          lasya    daughter
5          srinu     brother
6       subbarao     mavayya

In [9]:
M1.groupby('Relation')['names'].count()

Relation
akka          1
brother       1
daughter      1
mavayya       1
menakodalu    1
mother        1
pinni         1
Name: names, dtype: int64

In [10]:
F1=pd.read_excel(r"C:\Users\hp\OneDrive\Documents\Downloads\Fatherside_family.xlsx",sheet_name="Sheet2")
F1

       Names         Relation
0  durga rao           father
1  ramaswamy       peddananna
2     prasad           babayi
3     venkat           cousin
4      samba          brother
5       raja  younger brother

In [11]:
F1.groupby('Relation')['Names'].count()

Relation
babayi             1
brother            1
cousin             1
father             1
peddananna         1
younger brother    1
Name: Names, dtype: int64

In [ ]:
#Q4>Create and import file
#1. Create a Dal related  dal_items.xlsx file and import file in spyder (atleast 5 names, columns are VegFoodName*Taste)
#2. Summarize data by taste wise no.of fooditems.
#3. Create a vegitable related  vegitable_items.xlsx file and import file in spyder (atleast 5 names, columns are VegFoodName*Taste)
#4. Summarize data by taste wise no.of fooditems.

In [2]:
import pandas
import pandas as pd
dal=pd.read_excel(r"D:\Bujji\dal_items.xlsx")
dal

    veg_food_names    Taste
0       tomato dal     good
1           sambar    super
2      cabbage dal  average
3  ridge gourd dal    super
4      gongura dal     good

In [3]:
dal.groupby('Taste')['veg_food_names'].count()

Taste
average    1
good       2
super      2
Name: veg_food_names, dtype: int64

In [4]:
veg=pd.read_excel(r"D:\Bujji\dal_items.xlsx",sheet_name='Sheet2')
veg

     veg food_items    Taste
0  lady fingers fry    super
1           alu fry  average
2     brinjal curry     good
3  mushroooms curry    super
4   drumstick curry     good

In [5]:
veg.groupby('Taste')['veg food_items'].count()

Taste
average    1
good       2
super      2
Name: veg food_items, dtype: int64

In [ ]:
#Q5>Create and import file
#1. Create a soups related  soups_items.xlsx file and import file in spyder (atleast 5 names, columns are soups*Taste)
#2. Summarize data by taste wise no.of fooditems.
#3. Create a fry related  fry_items.xlsx file and import file in spyder (atleast 5 names, columns are fry*Taste)
#4. Summarize data by taste wise no.of fooditems.

In [6]:
import pandas
import pandas as pd
soups=pd.read_excel(r"D:\Bujji\soup_items.xlsx")
soups

          soup items    Taste
0         beans soup     good
1        tomoto soup    super
2       pumpkin soup  average
3  french onion soup     good
4       chicken soup    super

In [7]:
soups.groupby('Taste')['soup items'].count()

Taste
average    1
good       2
super      2
Name: soup items, dtype: int64

In [8]:
import pandas
import pandas as pd
fry=pd.read_excel(r"D:\Bujji\soup_items.xlsx",sheet_name='Sheet2')
fry

     Fry items    Taste
0  chicken fry    super
1     fish fry     good
2   france fry    super
3      egg fry  average
4   potato fry     good

In [9]:
fry.groupby('Taste')['Fry items'].count()

Taste
average    1
good       2
super      2
Name: Fry items, dtype: int64

In [ ]:
#Q6>Create and import file
#1. Create a Chicken related chicken_items.xlsx file and import file in spyder (atleast 5 names, columns are NonVegFoodName*Taste)
#2. Summarize data by taste wise no.of fooditems.
#3. Create a mutton related mutton_items.xlsx file and import file in spyder (atleast 5 names, columns are NonVegFoodName*Taste)
#4. Summarize data by taste wise no.of fooditems.

In [10]:
import pandas
import pandas as pd
chicken=pd.read_excel(r"D:\Bujji\chicken items.xlsx")
chicken

     chicken items    Taste
0      chicken fry    super
1    chicken curry     good
2       chicken 65  average
3  chicken biryani    super
4    chicken kurma     good

In [11]:
chicken.groupby('Taste')['chicken items'].count()

Taste
average    1
good       2
super      2
Name: chicken items, dtype: int64

In [12]:
mutton=pd.read_excel(r"D:\Bujji\chicken items.xlsx",sheet_name='Sheet2')
mutton

     Mutton items    Taste
0    mutton curry  average
1     mutton soup     good
2    mutton tikka  average
3  mutton biryani    super
4      mutton fry     good

In [14]:
mutton.groupby('Taste')['Mutton items'].count()

Taste
average    2
good       2
super      1
Name: Mutton items, dtype: int64

In [ ]:
#Q7>Create and import file
#1. Create a red colour flowers redflowers_names.xlsx file and import file in spyder   (atleast 3 names, columns are FlowerName*color)
#2. Summarize data by color wise no.of flowers.
#3. Create a white colour flowers whiteflowers_names.xlsx file  and import file in spyder  (atleast 3 names, columns are FlowerName*color)
#4. Summarize data by color wise no.of flowers.
#5. Create a pink colour flowers whiteflowers_names.xlsx file and import file in spyder   (atleast 3 names, columns are FlowerName*color)
#6. Summarize data by color wise no.of flowers.
#7. Create a yellow colour flowers whiteflowers_names.xlsx file and import file in spyder   (atleast 3 names, columns are FlowerName*color)
#8. Summarize data by color wise no.of flowers.

In [15]:
import pandas
import pandas as pd
red=pd.read_excel(r"D:\Bujji\colour_names.xlsx",sheet_name='Sheet4')
red

  Flower names colour
0         rose    red
1     mandaram    red
2    kanakaram    red
3       tulips    red

In [33]:
red.groupby("colour")['Flower names'].count()

        Flower names
colour
red                4

In [16]:
import pandas
import pandas as pd
white=pd.read_excel(r"D:\Bujji\colour_names.xlsx",sheet_name='Sheet3')
white

  Flower names colour
0         rose  white
1        lilly  white
2      ganneru  white

In [17]:
white.groupby('colour')['Flower names'].count()

colour
white    3
Name: Flower names, dtype: int64

In [18]:
import pandas
import pandas as pd
pink=pd.read_excel(r"D:\Bujji\colour_names.xlsx",sheet_name='Sheet2')
pink

  Flower names colour
0         rose   pink
1      ganneru   pink
2     mandaram   pink
3    chamanthi   pink

In [19]:
pink.groupby('colour')['Flower names'].count()

colour
pink    4
Name: Flower names, dtype: int64

In [20]:
import pandas
import pandas as pd
yellow=pd.read_excel(r"D:\Bujji\colour_names.xlsx")
yellow

   Flower names  colour
0      chamanti  yellow
1    marry gold  yellow
2          rose  yellow
3  kanakambaram  yellow

In [21]:
yellow.groupby('colour')['Flower names'].count()

colour
yellow    4
Name: Flower names, dtype: int64